export interface Zags {
	name: string;
	address: string;
	phone: string;
}

export interface Morgue {
	institution: string;
	address: string;
	schedule: string;
}

export interface Cemetery {
	district: string;
	name: string;
	location: string;
}

export const zagsData: Zags[] = [
	{
		name: "Индустриальный отдел управления ЗАГС",
		address: "614022 г. Пермь, ул.Мира,15",
		phone: "227-93-18, 227-99-88",
	},
	{
		name: "Дзержинский отдел управления ЗАГС",
		address: "614068, г. Пермь, ул. Ленина, 98",
		phone: "236-77-70, 236-79-77",
	},
	{
		name: "Кировский отдел управления ЗАГС",
		address: "614113 г. Пермь, ул. Кировоградская, 43",
		phone: "252-35-70, 252-09-58",
	},
	{
		name: "Специализированный отдел управления ЗАГС",
		address: "614000 г. Пермь, ул. Газеты Звезда, 8",
		phone: "212-76-92, 212-99-83",
	},
	{
		name: "Мотовилихинский отдел управления ЗАГС",
		address: "614060 г. Пермь, ул. Уральская, 111",
		phone: "260-14-24, 282-52-43",
	},
	{
		name: "Орджоникидзевский отдел управления ЗАГС",
		address: "614030 г. Пермь, ул. Пулковская, 7",
		phone: "274-57-41, 274-55-08",
	},
	{
		name: "Свердловский отдел управления ЗАГС",
		address: "614039 г. Пермь, пр. Комсомольский, 69",
		phone: "241-37-77, 241-11-90, 241-03-26",
	},
];

export const morguesData: Morgue[] = [
	{
		institution:
			"Клиническое патологоанатомическое бюро Патологоанатомическое отделение № 1",
		address: "г.Пермь, ул. Писарева 56 лит Д",
		schedule: "Пн-Пт: 08.00-15.00, Сб, Вс: выходной",
	},
	{
		institution:
			"Клиническое патологоанатомическое бюро Патологоанатомическое отделение № 2",
		address: "г.Пермь, ул. Автозаводская, 82 лит Н",
		schedule: "Пн-Пт: 08.00-15.00, Сб, Вс: выходной",
	},
	{
		institution:
			"Клиническое патологоанатомическое бюро Патологоанатомическое отделение № 3",
		address: "г.Пермь, ул. Братьев Игнатовых, 2 лит Л1",
		schedule: "Пн-Пт: 08.00-15.00, Сб, Вс: выходной",
	},
	{
		institution:
			"Клиническое патологоанатомическое бюро Патологоанатомическое отделение № 3",
		address: "г.Пермь, ул. Плеханова, 36 лит К",
		schedule: "Пн-Пт: 08.00-15.00, Сб, Вс: выходной",
	},
	{
		institution:
			"Клиническое патологоанатомическое бюро Патологоанатомическое отделение № 4",
		address: "г.Пермь, ул.Грачева, 12 лит С",
		schedule: "Пн-Пт: 08.00-15.00, Сб, Вс: выходной",
	},
	{
		institution: "Пермское краевое бюро судебно-медицинской экспертизы",
		address: "г.Пермь, ул. Старцева, 61",
		schedule: "Пн-Сб: 09.00-17.00, Вс: выходной",
	},
	{
		institution:
			"Патологоанатомическое отделение Пермской краевой клинической больницы",
		address: "г.Пермь, ул. Пушкина, 85Б",
		schedule: "Пн-Пт: 08.00-15.00, Сб, Вс: выходной",
	},
];

export const cemeteriesData: Cemetery[] = [
	{
		district: "Дзержинский",
		name: "Северное",
		location: "г. Пермь, ул. Красноборская, 200/1",
	},
	{
		district: "Дзержинский",
		name: "Окуловское",
		location: "г. Пермь, напротив кладбища «Северное»",
	},
	{
		district: "Индустриальный район",
		name: "Верхне-Мулинское",
		location: "г. Пермь, ул. 5-я Ипподромная",
	},
	{
		district: "Кировский",
		name: "Закамское",
		location: "г. Пермь, ул. Липатова,35",
	},
	{
		district: "Кировский",
		name: "Заборное",
		location: "г. Пермь, ул. Заборная",
	},
	{
		district: "Кировский",
		name: "Блочное",
		location: "г. Пермь, ул. Блочная",
	},
	{
		district: "Мотовилихинский",
		name: "Запрудское",
		location: "г. Пермь ул. Павлика Морозова",
	},
	{
		district: "Мотовилихинский",
		name: "Верхне-Курьинское",
		location: "г. Пермь, мкр. Верхняя Курья, ул. 2-я Линия",
	},
	{
		district: "Орджоникидзевский",
		name: "Кислотные дачи",
		location: "г. Пермь, ул. Генерала Доватора, 9/1",
	},
	{
		district: "Орджоникидзевский",
		name: "на Банной горе (новое)",
		location: "г. Пермь, Соликамский тракт, 2",
	},
	{
		district: "Орджоникидзевский",
		name: "на Банной горе (старое)",
		location: "г. Пермь, ул. 2-я Корсуньская",
	},
	{
		district: "Орджоникидзевский",
		name: "Заозерское",
		location: "г. Пермь, мкр. Турбино",
	},
	{
		district: "Орджоникидзевский",
		name: "Головановское",
		location: "г. Пермь, ул.Фрунзе",
	},
	{
		district: "Свердловский",
		name: "Южное",
		location: "г. Пермь, Южная дамба, 1",
	},
	{
		district: "Свердловский",
		name: "Егошихинское",
		location: "г. Пермь, ул. Тихая",
	},
	{
		district: "Свердловский",
		name: "Воинское",
		location: "п. Новые Ляды",
	},
	{
		district: "Новые Ляды",
		name: "Ново-Лядовское",
		location: "г. Пермь, посёлок Новые Ляды",
	},
];
